GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3v(e)xx-pinctrl.h
/* EXMC_A1 */
#define EXMC_A1_PB0 \
	GD32_PINMUX_AF('B', 0, AF11)
#define EXMC_A1_PF7 \
	GD32_PINMUX_AF('F', 7, AF12)

/* EXMC_A10 */
#define EXMC_A10_PB13 \
	GD32_PINMUX_AF('B', 13, AF11)

/* EXMC_A11 */
#define EXMC_A11_PB14 \
	GD32_PINMUX_AF('B', 14, AF11)

/* EXMC_A12 */
#define EXMC_A12_PB15 \
	GD32_PINMUX_AF('B', 15, AF11)

/* EXMC_A13 */
#define EXMC_A13_PA0 \
	GD32_PINMUX_AF('A', 0, AF11)

/* EXMC_A14 */
#define EXMC_A14_PA1 \
	GD32_PINMUX_AF('A', 1, AF11)

/* EXMC_A15 */
#define EXMC_A15_PA2 \
	GD32_PINMUX_AF('A', 2, AF11)

/* EXMC_A16 */
#define EXMC_A16_PA3 \
	GD32_PINMUX_AF('A', 3, AF11)
#define EXMC_A16_PD11 \
	GD32_PINMUX_AF('D', 11, AF12)

/* EXMC_A17 */
#define EXMC_A17_PA4 \
	GD32_PINMUX_AF('A', 4, AF11)
#define EXMC_A17_PD12 \
	GD32_PINMUX_AF('D', 12, AF12)

/* EXMC_A18 */
#define EXMC_A18_PA5 \
	GD32_PINMUX_AF('A', 5, AF11)
#define EXMC_A18_PD13 \
	GD32_PINMUX_AF('D', 13, AF12)

/* EXMC_A19 */
#define EXMC_A19_PA6 \
	GD32_PINMUX_AF('A', 6, AF11)
#define EXMC_A19_PE3 \
	GD32_PINMUX_AF('E', 3, AF12)

/* EXMC_A2 */
#define EXMC_A2_PB1 \
	GD32_PINMUX_AF('B', 1, AF11)
#define EXMC_A2_PF2 \
	GD32_PINMUX_AF('F', 2, AF12)

/* EXMC_A20 */
#define EXMC_A20_PA7 \
	GD32_PINMUX_AF('A', 7, AF11)
#define EXMC_A20_PE4 \
	GD32_PINMUX_AF('E', 4, AF12)

/* EXMC_A21 */
#define EXMC_A21_PA8 \
	GD32_PINMUX_AF('A', 8, AF9)
#define EXMC_A21_PE5 \
	GD32_PINMUX_AF('E', 5, AF12)

/* EXMC_A22 */
#define EXMC_A22_PA9 \
	GD32_PINMUX_AF('A', 9, AF11)
#define EXMC_A22_PE6 \
	GD32_PINMUX_AF('E', 6, AF12)

/* EXMC_A23 */
#define EXMC_A23_PA10 \
	GD32_PINMUX_AF('A', 10, AF9)
#define EXMC_A23_PE2 \
	GD32_PINMUX_AF('E', 2, AF12)

/* EXMC_A24 */
#define EXMC_A24_PA11 \
	GD32_PINMUX_AF('A', 11, AF4)
#define EXMC_A24_PF8 \
	GD32_PINMUX_AF('F', 8, AF12)

/* EXMC_A25 */
#define EXMC_A25_PA12 \
	GD32_PINMUX_AF('A', 12, AF4)
#define EXMC_A25_PF9 \
	GD32_PINMUX_AF('F', 9, AF12)

/* EXMC_A3 */
#define EXMC_A3_PB2 \
	GD32_PINMUX_AF('B', 2, AF11)
#define EXMC_A3_PF3 \
	GD32_PINMUX_AF('F', 3, AF12)

/* EXMC_A4 */
#define EXMC_A4_PB6 \
	GD32_PINMUX_AF('B', 6, AF14)
#define EXMC_A4_PF4 \
	GD32_PINMUX_AF('F', 4, AF12)

/* EXMC_A5 */
#define EXMC_A5_PA13 \
	GD32_PINMUX_AF('A', 13, AF9)
#define EXMC_A5_PF5 \
	GD32_PINMUX_AF('F', 5, AF12)

/* EXMC_A6 */
#define EXMC_A6_PB9 \
	GD32_PINMUX_AF('B', 9, AF11)

/* EXMC_A7 */
#define EXMC_A7_PB10 \
	GD32_PINMUX_AF('B', 10, AF11)

/* EXMC_A8 */
#define EXMC_A8_PB11 \
	GD32_PINMUX_AF('B', 11, AF11)

/* EXMC_A9 */
#define EXMC_A9_PB12 \
	GD32_PINMUX_AF('B', 12, AF11)

/* EXMC_CLK */
#define EXMC_CLK_PC0 \
	GD32_PINMUX_AF('C', 0, AF12)
#define EXMC_CLK_PD3 \
	GD32_PINMUX_AF('D', 3, AF12)

/* EXMC_D0 */
#define EXMC_D0_PC10 \
	GD32_PINMUX_AF('C', 10, AF12)
#define EXMC_D0_PD14 \
	GD32_PINMUX_AF('D', 14, AF12)

/* EXMC_D1 */
#define EXMC_D1_PC11 \
	GD32_PINMUX_AF('C', 11, AF12)
#define EXMC_D1_PD15 \
	GD32_PINMUX_AF('D', 15, AF12)

/* EXMC_D10 */
#define EXMC_D10_PE13 \
	GD32_PINMUX_AF('E', 13, AF12)

/* EXMC_D11 */
#define EXMC_D11_PE14 \
	GD32_PINMUX_AF('E', 14, AF12)

/* EXMC_D12 */
#define EXMC_D12_PE15 \
	GD32_PINMUX_AF('E', 15, AF12)

/* EXMC_D13 */
#define EXMC_D13_PD8 \
	GD32_PINMUX_AF('D', 8, AF12)

/* EXMC_D14 */
#define EXMC_D14_PD9 \
	GD32_PINMUX_AF('D', 9, AF12)

/* EXMC_D15 */
#define EXMC_D15_PD10 \
	GD32_PINMUX_AF('D', 10, AF12)

/* EXMC_D2 */
#define EXMC_D2_PD0 \
	GD32_PINMUX_AF('D', 0, AF12)

/* EXMC_D3 */
#define EXMC_D3_PD1 \
	GD32_PINMUX_AF('D', 1, AF12)

/* EXMC_D4 */
#define EXMC_D4_PE7 \
	GD32_PINMUX_AF('E', 7, AF12)

/* EXMC_D5 */
#define EXMC_D5_PE8 \
	GD32_PINMUX_AF('E', 8, AF12)

/* EXMC_D6 */
#define EXMC_D6_PE9 \
	GD32_PINMUX_AF('E', 9, AF12)

/* EXMC_D7 */
#define EXMC_D7_PE10 \
	GD32_PINMUX_AF('E', 10, AF12)

/* EXMC_D8 */
#define EXMC_D8_PE11 \
	GD32_PINMUX_AF('E', 11, AF12)

/* EXMC_D9 */
#define EXMC_D9_PE12 \
	GD32_PINMUX_AF('E', 12, AF12)

/* EXMC_NADV */
#define EXMC_NADV_PB7 \
	GD32_PINMUX_AF('B', 7, AF12)

/* EXMC_NBL0 */
#define EXMC_NBL0_PC8 \
	GD32_PINMUX_AF('C', 8, AF12)
#define EXMC_NBL0_PE0 \
	GD32_PINMUX_AF('E', 0, AF12)

/* EXMC_NBL1 */
#define EXMC_NBL1_PC9 \
	GD32_PINMUX_AF('C', 9, AF12)
#define EXMC_NBL1_PE1 \
	GD32_PINMUX_AF('E', 1, AF12)

/* EXMC_NE0 */
#define EXMC_NE0_PC4 \
	GD32_PINMUX_AF('C', 4, AF12)
#define EXMC_NE0_PD7 \
	GD32_PINMUX_AF('D', 7, AF12)

/* EXMC_NE1 */
#define EXMC_NE1_PC5 \
	GD32_PINMUX_AF('C', 5, AF12)

/* EXMC_NE2 */
#define EXMC_NE2_PC6 \
	GD32_PINMUX_AF('C', 6, AF12)

/* EXMC_NE3 */
#define EXMC_NE3_PC7 \
	GD32_PINMUX_AF('C', 7, AF12)

/* EXMC_NL */
#define EXMC_NL_PB7 \
	GD32_PINMUX_AF('B', 7, AF12)

/* EXMC_NOE */
#define EXMC_NOE_PC1 \
	GD32_PINMUX_AF('C', 1, AF12)
#define EXMC_NOE_PD4 \
	GD32_PINMUX_AF('D', 4, AF12)

/* EXMC_NWAIT */
#define EXMC_NWAIT_PC3 \
	GD32_PINMUX_AF('C', 3, AF12)
#define EXMC_NWAIT_PD6 \
	GD32_PINMUX_AF('D', 6, AF12)

/* EXMC_NWE */
#define EXMC_NWE_PC2 \
	GD32_PINMUX_AF('C', 2, AF12)
#define EXMC_NWE_PD5 \
	GD32_PINMUX_AF('D', 5, AF12)

/* HPDF_CKIN0 */
#define HPDF_CKIN0_PB5 \
	GD32_PINMUX_AF('B', 5, AF0)
#define HPDF_CKIN0_PC0 \
	GD32_PINMUX_AF('C', 0, AF8)

/* HPDF_CKIN1 */
#define HPDF_CKIN1_PB2 \
	GD32_PINMUX_AF('B', 2, AF5)
#define HPDF_CKIN1_PB13 \
	GD32_PINMUX_AF('B', 13, AF10)
#define HPDF_CKIN1_PC2 \
	GD32_PINMUX_AF('C', 2, AF8)
#define HPDF_CKIN1_PD7 \
	GD32_PINMUX_AF('D', 7, AF6)

/* HPDF_CKIN2 */
#define HPDF_CKIN2_PB15 \
	GD32_PINMUX_AF('B', 15, AF10)
#define HPDF_CKIN2_PC4 \
	GD32_PINMUX_AF('C', 4, AF8)
#define HPDF_CKIN2_PE8 \
	GD32_PINMUX_AF('E', 8, AF3)
#define HPDF_CKIN2_PF5 \
	GD32_PINMUX_AF('F', 5, AF6)

/* HPDF_CKIN3 */
#define HPDF_CKIN3_PC6 \
	GD32_PINMUX_AF('C', 6, AF0)
#define HPDF_CKIN3_PD8 \
	GD32_PINMUX_AF('D', 8, AF3)
#define HPDF_CKIN3_PE5 \
	GD32_PINMUX_AF('E', 5, AF3)

/* HPDF_CKIN4 */
#define HPDF_CKIN4_PC1 \
	GD32_PINMUX_AF('C', 1, AF4)
#define HPDF_CKIN4_PD6 \
	GD32_PINMUX_AF('D', 6, AF3)
#define HPDF_CKIN4_PE11 \
	GD32_PINMUX_AF('E', 11, AF3)

/* HPDF_CKIN5 */
#define HPDF_CKIN5_PB7 \
	GD32_PINMUX_AF('B', 7, AF0)
#define HPDF_CKIN5_PC10 \
	GD32_PINMUX_AF('C', 10, AF0)
#define HPDF_CKIN5_PE13 \
	GD32_PINMUX_AF('E', 13, AF3)

