GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3v(e)xx-pinctrl.h
/* HPDF_CKIN6 */
#define HPDF_CKIN6_PD0 \
	GD32_PINMUX_AF('D', 0, AF3)

/* HPDF_CKIN7 */
#define HPDF_CKIN7_PB8 \
	GD32_PINMUX_AF('B', 8, AF3)
#define HPDF_CKIN7_PB11 \
	GD32_PINMUX_AF('B', 11, AF6)

/* HPDF_CKOUT */
#define HPDF_CKOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF5)
#define HPDF_CKOUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF0)
#define HPDF_CKOUT_PD3 \
	GD32_PINMUX_AF('D', 3, AF3)
#define HPDF_CKOUT_PD10 \
	GD32_PINMUX_AF('D', 10, AF3)
#define HPDF_CKOUT_PE9 \
	GD32_PINMUX_AF('E', 9, AF3)

/* HPDF_DATAIN0 */
#define HPDF_DATAIN0_PB10 \
	GD32_PINMUX_AF('B', 10, AF3)
#define HPDF_DATAIN0_PC1 \
	GD32_PINMUX_AF('C', 1, AF8)

/* HPDF_DATAIN1 */
#define HPDF_DATAIN1_PB1 \
	GD32_PINMUX_AF('B', 1, AF5)
#define HPDF_DATAIN1_PB12 \
	GD32_PINMUX_AF('B', 12, AF10)
#define HPDF_DATAIN1_PC3 \
	GD32_PINMUX_AF('C', 3, AF8)
#define HPDF_DATAIN1_PD6 \
	GD32_PINMUX_AF('D', 6, AF4)

/* HPDF_DATAIN2 */
#define HPDF_DATAIN2_PB14 \
	GD32_PINMUX_AF('B', 14, AF10)
#define HPDF_DATAIN2_PC5 \
	GD32_PINMUX_AF('C', 5, AF8)
#define HPDF_DATAIN2_PE7 \
	GD32_PINMUX_AF('E', 7, AF3)
#define HPDF_DATAIN2_PF4 \
	GD32_PINMUX_AF('F', 4, AF6)

/* HPDF_DATAIN3 */
#define HPDF_DATAIN3_PB11 \
	GD32_PINMUX_AF('B', 11, AF3)
#define HPDF_DATAIN3_PC7 \
	GD32_PINMUX_AF('C', 7, AF0)
#define HPDF_DATAIN3_PD9 \
	GD32_PINMUX_AF('D', 9, AF3)
#define HPDF_DATAIN3_PE4 \
	GD32_PINMUX_AF('E', 4, AF3)

/* HPDF_DATAIN4 */
#define HPDF_DATAIN4_PC0 \
	GD32_PINMUX_AF('C', 0, AF10)
#define HPDF_DATAIN4_PD7 \
	GD32_PINMUX_AF('D', 7, AF3)
#define HPDF_DATAIN4_PE10 \
	GD32_PINMUX_AF('E', 10, AF3)

/* HPDF_DATAIN5 */
#define HPDF_DATAIN5_PB6 \
	GD32_PINMUX_AF('B', 6, AF0)
#define HPDF_DATAIN5_PC11 \
	GD32_PINMUX_AF('C', 11, AF0)
#define HPDF_DATAIN5_PE12 \
	GD32_PINMUX_AF('E', 12, AF3)

/* HPDF_DATAIN6 */
#define HPDF_DATAIN6_PD1 \
	GD32_PINMUX_AF('D', 1, AF3)

/* HPDF_DATAIN7 */
#define HPDF_DATAIN7_PB9 \
	GD32_PINMUX_AF('B', 9, AF3)
#define HPDF_DATAIN7_PB10 \
	GD32_PINMUX_AF('B', 10, AF6)

/* HRTIMER_EXEV0 */
#define HRTIMER_EXEV0_PC12 \
	GD32_PINMUX_AF('C', 12, AF3)

/* HRTIMER_EXEV1 */
#define HRTIMER_EXEV1_PC11 \
	GD32_PINMUX_AF('C', 11, AF3)

/* HRTIMER_EXEV2 */
#define HRTIMER_EXEV2_PB7 \
	GD32_PINMUX_AF('B', 7, AF13)

/* HRTIMER_EXEV3 */
#define HRTIMER_EXEV3_PB6 \
	GD32_PINMUX_AF('B', 6, AF13)

/* HRTIMER_EXEV4 */
#define HRTIMER_EXEV4_PB9 \
	GD32_PINMUX_AF('B', 9, AF13)

/* HRTIMER_EXEV5 */
#define HRTIMER_EXEV5_PB5 \
	GD32_PINMUX_AF('B', 5, AF13)

/* HRTIMER_EXEV6 */
#define HRTIMER_EXEV6_PB4 \
	GD32_PINMUX_AF('B', 4, AF13)

/* HRTIMER_EXEV7 */
#define HRTIMER_EXEV7_PB8 \
	GD32_PINMUX_AF('B', 8, AF13)

/* HRTIMER_EXEV8 */
#define HRTIMER_EXEV8_PB3 \
	GD32_PINMUX_AF('B', 3, AF12)

/* HRTIMER_EXEV9 */
#define HRTIMER_EXEV9_PC5 \
	GD32_PINMUX_AF('C', 5, AF13)
#define HRTIMER_EXEV9_PC6 \
	GD32_PINMUX_AF('C', 6, AF3)

/* HRTIMER_FLT0 */
#define HRTIMER_FLT0_PA12 \
	GD32_PINMUX_AF('A', 12, AF12)

/* HRTIMER_FLT1 */
#define HRTIMER_FLT1_PA15 \
	GD32_PINMUX_AF('A', 15, AF13)

/* HRTIMER_FLT2 */
#define HRTIMER_FLT2_PB10 \
	GD32_PINMUX_AF('B', 10, AF13)

/* HRTIMER_FLT3 */
#define HRTIMER_FLT3_PB11 \
	GD32_PINMUX_AF('B', 11, AF13)

/* HRTIMER_FLT4 */
#define HRTIMER_FLT4_PB0 \
	GD32_PINMUX_AF('B', 0, AF13)
#define HRTIMER_FLT4_PC7 \
	GD32_PINMUX_AF('C', 7, AF3)

/* HRTIMER_FLT5 */
#define HRTIMER_FLT5_PC10 \
	GD32_PINMUX_AF('C', 10, AF13)

/* HRTIMER_FLT6 */
#define HRTIMER_FLT6_PC3 \
	GD32_PINMUX_AF('C', 3, AF13)

/* HRTIMER_FLT7 */
#define HRTIMER_FLT7_PC4 \
	GD32_PINMUX_AF('C', 4, AF13)

/* HRTIMER_SCIN */
#define HRTIMER_SCIN_PB2 \
	GD32_PINMUX_AF('B', 2, AF13)
#define HRTIMER_SCIN_PB6 \
	GD32_PINMUX_AF('B', 6, AF12)

/* HRTIMER_SCOUT */
#define HRTIMER_SCOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF13)
#define HRTIMER_SCOUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF12)

/* HRTIMER_ST0CH0 */
#define HRTIMER_ST0CH0_PA8 \
	GD32_PINMUX_AF('A', 8, AF13)

/* HRTIMER_ST0CH1 */
#define HRTIMER_ST0CH1_PA9 \
	GD32_PINMUX_AF('A', 9, AF13)

/* HRTIMER_ST1CH0 */
#define HRTIMER_ST1CH0_PA10 \
	GD32_PINMUX_AF('A', 10, AF13)

/* HRTIMER_ST1CH1 */
#define HRTIMER_ST1CH1_PA11 \
	GD32_PINMUX_AF('A', 11, AF12)

/* HRTIMER_ST2CH0 */
#define HRTIMER_ST2CH0_PA4 \
	GD32_PINMUX_AF('A', 4, AF12)
#define HRTIMER_ST2CH0_PB12 \
	GD32_PINMUX_AF('B', 12, AF13)

/* HRTIMER_ST2CH1 */
#define HRTIMER_ST2CH1_PA5 \
	GD32_PINMUX_AF('A', 5, AF12)
#define HRTIMER_ST2CH1_PB13 \
	GD32_PINMUX_AF('B', 13, AF13)

/* HRTIMER_ST3CH0 */
#define HRTIMER_ST3CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF12)
#define HRTIMER_ST3CH0_PB14 \
	GD32_PINMUX_AF('B', 14, AF13)

/* HRTIMER_ST3CH1 */
#define HRTIMER_ST3CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF12)
#define HRTIMER_ST3CH1_PB15 \
	GD32_PINMUX_AF('B', 15, AF13)

/* HRTIMER_ST4CH0 */
#define HRTIMER_ST4CH0_PB0 \
	GD32_PINMUX_AF('B', 0, AF9)
#define HRTIMER_ST4CH0_PC8 \
	GD32_PINMUX_AF('C', 8, AF3)

/* HRTIMER_ST4CH1 */
#define HRTIMER_ST4CH1_PB1 \
	GD32_PINMUX_AF('B', 1, AF9)
#define HRTIMER_ST4CH1_PC9 \
	GD32_PINMUX_AF('C', 9, AF3)

/* HRTIMER_ST5CH0 */
#define HRTIMER_ST5CH0_PB2 \
	GD32_PINMUX_AF('B', 2, AF9)
#define HRTIMER_ST5CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF13)

/* HRTIMER_ST5CH1 */
#define HRTIMER_ST5CH1_PB3 \
	GD32_PINMUX_AF('B', 3, AF9)
#define HRTIMER_ST5CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF6)
#define HRTIMER_ST5CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF13)

/* HRTIMER_ST6CH0 */
#define HRTIMER_ST6CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF12)
#define HRTIMER_ST6CH0_PE0 \
	GD32_PINMUX_AF('E', 0, AF13)

/* HRTIMER_ST6CH1 */
#define HRTIMER_ST6CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF12)
#define HRTIMER_ST6CH1_PE1 \
	GD32_PINMUX_AF('E', 1, AF13)

/* HRTIMER_ST7CH0 */
#define HRTIMER_ST7CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF12)
#define HRTIMER_ST7CH0_PE2 \
	GD32_PINMUX_AF('E', 2, AF13)

/* HRTIMER_ST7CH1 */
#define HRTIMER_ST7CH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF12)
#define HRTIMER_ST7CH1_PE3 \
	GD32_PINMUX_AF('E', 3, AF13)

/* I2C0_SCL */
#define I2C0_SCL_PA13 \
	GD32_PINMUX_AF('A', 13, AF4)
#define I2C0_SCL_PA15 \
	GD32_PINMUX_AF('A', 15, AF4)
#define I2C0_SCL_PB6 \
	GD32_PINMUX_AF('B', 6, AF4)
#define I2C0_SCL_PB8 \
	GD32_PINMUX_AF('B', 8, AF4)

/* I2C0_SDA */
#define I2C0_SDA_PA14 \
	GD32_PINMUX_AF('A', 14, AF4)
#define I2C0_SDA_PB7 \
	GD32_PINMUX_AF('B', 7, AF4)
#define I2C0_SDA_PB9 \
	GD32_PINMUX_AF('B', 9, AF4)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AF('B', 5, AF4)

/* I2C1_SCL */
#define I2C1_SCL_PA9 \
	GD32_PINMUX_AF('A', 9, AF4)
#define I2C1_SCL_PC4 \
	GD32_PINMUX_AF('C', 4, AF4)

/* I2C1_SDA */
#define I2C1_SDA_PA8 \
	GD32_PINMUX_AF('A', 8, AF4)
#define I2C1_SDA_PF0 \
	GD32_PINMUX_AF('F', 0, AF4)

/* I2C1_SMBA */
#define I2C1_SMBA_PA10 \
	GD32_PINMUX_AF('A', 10, AF4)
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AF('B', 12, AF4)
#define I2C1_SMBA_PF2 \
	GD32_PINMUX_AF('F', 2, AF4)

/* I2C2_SCL */
#define I2C2_SCL_PA8 \
	GD32_PINMUX_AF('A', 8, AF2)
#define I2C2_SCL_PC8 \
	GD32_PINMUX_AF('C', 8, AF8)
#define I2C2_SCL_PF3 \
	GD32_PINMUX_AF('F', 3, AF4)

